CANopenNode/CanOpenSTM32/stm32f7xx_fdcan_rtos/Core/CANOpen_STM32F7xx/CO_driver_stm32f769I-eval.c
        /*
         * Try to send more buffers, process all empty ones
         *
         * This function is always called from interrupt,
         * however to make sure no preemption can happen, interrupts are anyway locked
         * (unless you can guarantee no higher priority interrupt will try to access to FDCAN instance and send data,
         *  then no need to lock interrupts..)
         */
        CO_LOCK_CAN_SEND(CANModule_local);
        for (i = CANModule_local->txSize; i > 0U; --i, ++buffer) {
            /* Try to send message */
            if (buffer->bufferFull) {
                if (prv_send_can_message(CANModule_local, buffer)) {
                    buffer->bufferFull = false;
                    CANModule_local->CANtxCount--;
                    CANModule_local->bufferInhibitFlag = buffer->syncFlag;
                }
            }
        }
        /* Clear counter if no more messages */
        if (i == 0U) {
            CANModule_local->CANtxCount = 0U;
        }
        CO_UNLOCK_CAN_SEND(CANModule_local);
    }
}

/**
 * @brief
 *
 * @param hcan
 */
void HAL_CAN_TxMailbox0CompleteCallback(CAN_HandleTypeDef *hcan) {
  TxMailbox0CompleteCallback(hcan, 0);
}

/**
 * @brief
 *
 * @param hcan
 */
void HAL_CAN_TxMailbox1CompleteCallback(CAN_HandleTypeDef *hcan) {
  TxMailbox0CompleteCallback(hcan, 1);
}

/**
 * @brief
 *
 * @param hcan
 */
void HAL_CAN_TxMailbox2CompleteCallback(CAN_HandleTypeDef *hcan) {
  TxMailbox0CompleteCallback(hcan, 2);
}

/**
 * \brief           Low-level microcontroller support init callback
 * \param[in]       fdcanHandle: FDCAN handle instance
 */
void
HAL_CAN_MspInit(CAN_HandleTypeDef* hcan) {

  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if(hcan->Instance==CAN1)
  {
  /* USER CODE BEGIN CAN1_MspInit 0 */

  /* USER CODE END CAN1_MspInit 0 */
    /* Peripheral clock enable */
    __HAL_RCC_CAN1_CLK_ENABLE();

    __HAL_RCC_GPIOA_CLK_ENABLE();
    /**CAN1 GPIO Configuration
    PA12     ------> CAN1_TX
    PA11     ------> CAN1_RX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_12|GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF9_CAN1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* FDCAN1 interrupt Init */
    HAL_NVIC_SetPriority(CAN1_RX0_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);
    HAL_NVIC_SetPriority(CAN1_RX1_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
    HAL_NVIC_SetPriority(CAN1_TX_IRQn, 6, 0);
    HAL_NVIC_EnableIRQ(CAN1_TX_IRQn);
  }
}

/**
 * \brief           Low-level microcontroller support deinit callback
 * \param[in]       fdcanHandle: FDCAN handle instance
 */
void
HAL_CAN_MspDeInit(CAN_HandleTypeDef* hcan) {
    if (hcan->Instance == CAN1) {
        /* Peripheral clock disable */
        __HAL_RCC_CAN1_CLK_DISABLE();

        /*
         * FDCAN1 GPIO Configuration
         *
         * PH13     ------> FDCAN1_TX
         * PH14     ------> FDCAN1_RX
         */
        HAL_GPIO_DeInit(GPIOA, GPIO_PIN_11 | GPIO_PIN_12);

        /* FDCAN1 interrupt Deinit */
        HAL_NVIC_DisableIRQ(CAN1_RX0_IRQn);
        HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
        HAL_NVIC_DisableIRQ(CAN1_TX_IRQn);
    }
}

/**
 * \brief           This function handles FDCAN1 interrupt 0
 */
void
CAN1_TX_IRQHandler(void) {
  HAL_CAN_IRQHandler(&CanHandle);

    /* Wake-up application thread */
    CO_WAKEUP_APP_THREAD();
}

/**
 * \brief           This function handles FDCAN1 interrupt 1
 */
void
CAN1_RX0_IRQHandler(void) {
  HAL_CAN_IRQHandler(&CanHandle);

    /* Wake-up application thread */
    CO_WAKEUP_APP_THREAD();
}

/**
 * \brief           This function handles FDCAN1 interrupt 1
 */
void
CAN1_RX1_IRQHandler(void) {
  HAL_CAN_IRQHandler(&CanHandle);

    /* Wake-up application thread */
    CO_WAKEUP_APP_THREAD();
}
